Revit 2021.1 API
Entity.Get Method
Overload List
Name | Description
Get<FieldType>(String)
 Retrieves the value of the field in the entity.
Get<FieldType>(Field)
 Retrieves the value of the field in the entity.
Get<FieldType>(String, DisplayUnitType) |  Obsolete.
 Retrieves the value of the field in the entity.
Get<FieldType>(String, ForgeTypeId)
 Retrieves the value of the field in the entity.
Get<FieldType>(Field, DisplayUnitType) |  Obsolete.
 Retrieves the value of the field in the entity.
Get<FieldType>(Field, ForgeTypeId)
 Retrieves the value of the field in the entity.
See Also
Entity Class
Entity Members
Autodesk.Revit.DB.ExtensibleStorage Namespace